dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxDom_bf.h
/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI9_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI9_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI9_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI9_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI9_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI9_P_OFF (9u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI10_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI10_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI10_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI10_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI10_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI10_P_OFF (10u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI11_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI11_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI11_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI11_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI11_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI11_P_OFF (11u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_LEN (3u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_MSK (0x7u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.HPRS */
#define IFX_DOM_SCICTRL_PRIORITY_HPRS_OFF (16u)

/** \brief Length for Ifx_DOM_SCICTRL_ERRADDR_Bits.ADDR */
#define IFX_DOM_SCICTRL_ERRADDR_ADDR_LEN (32u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERRADDR_Bits.ADDR */
#define IFX_DOM_SCICTRL_ERRADDR_ADDR_MSK (0xffffffffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERRADDR_Bits.ADDR */
#define IFX_DOM_SCICTRL_ERRADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.RD_N */
#define IFX_DOM_SCICTRL_ERR_RD_N_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.RD_N */
#define IFX_DOM_SCICTRL_ERR_RD_N_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.RD_N */
#define IFX_DOM_SCICTRL_ERR_RD_N_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.WR_N */
#define IFX_DOM_SCICTRL_ERR_WR_N_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.WR_N */
#define IFX_DOM_SCICTRL_ERR_WR_N_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.WR_N */
#define IFX_DOM_SCICTRL_ERR_WR_N_OFF (1u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.SVM */
#define IFX_DOM_SCICTRL_ERR_SVM_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.SVM */
#define IFX_DOM_SCICTRL_ERR_SVM_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.SVM */
#define IFX_DOM_SCICTRL_ERR_SVM_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.OPC */
#define IFX_DOM_SCICTRL_ERR_OPC_LEN (4u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.OPC */
#define IFX_DOM_SCICTRL_ERR_OPC_MSK (0xfu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.OPC */
#define IFX_DOM_SCICTRL_ERR_OPC_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.TR_ID */
#define IFX_DOM_SCICTRL_ERR_TR_ID_LEN (8u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.TR_ID */
#define IFX_DOM_SCICTRL_ERR_TR_ID_MSK (0xffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.TR_ID */
#define IFX_DOM_SCICTRL_ERR_TR_ID_OFF (8u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.ADDR_EDC */
#define IFX_DOM_SCICTRL_ERR_ADDR_EDC_LEN (8u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.ADDR_EDC */
#define IFX_DOM_SCICTRL_ERR_ADDR_EDC_MSK (0xffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.ADDR_EDC */
#define IFX_DOM_SCICTRL_ERR_ADDR_EDC_OFF (16u)

/** \brief Length for Ifx_DOM_SCICTRL_ERR_Bits.MCI_SBS */
#define IFX_DOM_SCICTRL_ERR_MCI_SBS_LEN (8u)

/** \brief Mask for Ifx_DOM_SCICTRL_ERR_Bits.MCI_SBS */
#define IFX_DOM_SCICTRL_ERR_MCI_SBS_MSK (0xffu)

/** \brief Offset for Ifx_DOM_SCICTRL_ERR_Bits.MCI_SBS */
#define IFX_DOM_SCICTRL_ERR_MCI_SBS_OFF (24u)

/** \brief Length for Ifx_DOM_ID_Bits.MOD_REV */
#define IFX_DOM_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_DOM_ID_Bits.MOD_REV */
#define IFX_DOM_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_DOM_ID_Bits.MOD_REV */
#define IFX_DOM_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_DOM_ID_Bits.MOD_TYPE */
#define IFX_DOM_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_DOM_ID_Bits.MOD_TYPE */
#define IFX_DOM_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_DOM_ID_Bits.MOD_TYPE */
#define IFX_DOM_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_DOM_ID_Bits.MOD_NUMBER */
#define IFX_DOM_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_DOM_ID_Bits.MOD_NUMBER */
#define IFX_DOM_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_DOM_ID_Bits.MOD_NUMBER */
#define IFX_DOM_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI0 */
#define IFX_DOM_PESTAT_PESCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI0 */
#define IFX_DOM_PESTAT_PESCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI0 */
#define IFX_DOM_PESTAT_PESCI0_OFF (16u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI1 */
#define IFX_DOM_PESTAT_PESCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI1 */
#define IFX_DOM_PESTAT_PESCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI1 */
#define IFX_DOM_PESTAT_PESCI1_OFF (17u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI2 */
#define IFX_DOM_PESTAT_PESCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI2 */
#define IFX_DOM_PESTAT_PESCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI2 */
#define IFX_DOM_PESTAT_PESCI2_OFF (18u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI3 */
#define IFX_DOM_PESTAT_PESCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI3 */
#define IFX_DOM_PESTAT_PESCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI3 */
#define IFX_DOM_PESTAT_PESCI3_OFF (19u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI4 */
#define IFX_DOM_PESTAT_PESCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI4 */
#define IFX_DOM_PESTAT_PESCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI4 */
#define IFX_DOM_PESTAT_PESCI4_OFF (20u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI5 */
#define IFX_DOM_PESTAT_PESCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI5 */
#define IFX_DOM_PESTAT_PESCI5_MSK (0x1u)

